# mdv5a.yaml
nc: 4  # number of classes (animal, vehicle, person, wolf)
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  [[-1, 1, Conv, [80, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [160, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [160]],  # 2
   [-1, 1, Conv, [320, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [320]],  # 4
   [-1, 1, Conv, [640, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [640]],  # 6
   [-1, 1, Conv, [960, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [960]],  # 8
   [-1, 1, SPPF, [960, 5]],  # 9
  ]

head:
  [[-1, 1, Conv, [480, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [480, False]],  # 13

   [-1, 1, Conv, [320, 1, 1]],  # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [320, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [320, 3, 2]],  # 18
   [[-1, 13], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [480, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [480, 3, 2]],  # 21
   [[-1, 9], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [960, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]]  # Detect(P3, P4, P5)
  ]
